sterentev/atdf-device-asm-include/inc/ATmega406.inc
;***********************************************************************
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ******************
;*************** Script version: 0.07 **********************************
;*************** tab-width 8 *******************************************
;***********************************************************************
;
;* Target MCU        : ATmega406
;* Title             : Register/Mask/Bit Definitions for the ATmega406
;* File Name         : ATmega406.inc
;* Source Date       : 2026-01-22 07:11:00 UTC
;* Make Date         : 2026-06-01 14:52:59 UTC
;
;***********************************************************************

#ifndef _ATMEGA406_INC_
#define _ATMEGA406_INC_

;***********************************************************************
;********************* NOTES *******************************************
;***********************************************************************
;
; - Registers marked [MEMORY MAPPED] are extended I/O ports
;   and cannot be used with IN/OUT instructions
; - Register bits are specified by a bit number (for a single bit)
;   xor by mask (for bits group). In case bits in a group are placed sequentially
;   to each other (no gaps) a number for the lower bit in the group is defined also.
; - When a set of bitmask values is listed for bits group,
;   use those values without bit shifting operation
; - Some bitmasks MCU developers split on 2+ chunks and placed separately
;   (sometime in different registers). Such bitmaps are placed in
;   'EXTRA BITFIELDS VALUES' section. Refer to docs where such bits should be set.
; - FUSES and LOCKBITS in program skeleton are set to their production default values.
;
;***********************************************************************




; **********************************************************************
; ***************	DEVICE DEFINITIONS	************************
; **********************************************************************
;
.device	ATmega406
.equ	JTAGID		= 0x0950703F
.equ	SIGNATURE0	= 0x1e
.equ	SIGNATURE1	= 0x95
.equ	SIGNATURE2	= 0x07


; ************* CPU REGISTERS DEFINITIONS ******************************
;
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30



; **********************************************************************
; ***************	ADDR SPACES AND MAPPING	************************
; **********************************************************************
;
; ----------	PROG ADDRESS SPACE		------------------------
;   FLASH
.equ	ADDR_FLASH_START		= 0x0000
.equ	ADDR_FLASH_END			= 0x9FFF
.equ	ADDR_FLASH_SIZE			= 0xA000
;   BOOT_SECTION_1
.equ	ADDR_BOOT_SECTION_1_START	= 0x9E00
.equ	ADDR_BOOT_SECTION_1_END		= 0x9FFF
.equ	ADDR_BOOT_SECTION_1_SIZE	= 0x0200
;   BOOT_SECTION_2
.equ	ADDR_BOOT_SECTION_2_START	= 0x9C00
.equ	ADDR_BOOT_SECTION_2_END		= 0x9FFF
.equ	ADDR_BOOT_SECTION_2_SIZE	= 0x0400
;   BOOT_SECTION_3
.equ	ADDR_BOOT_SECTION_3_START	= 0x9800
.equ	ADDR_BOOT_SECTION_3_END		= 0x9FFF
.equ	ADDR_BOOT_SECTION_3_SIZE	= 0x0800
;   BOOT_SECTION_4
.equ	ADDR_BOOT_SECTION_4_START	= 0x9000
.equ	ADDR_BOOT_SECTION_4_END		= 0x9FFF
.equ	ADDR_BOOT_SECTION_4_SIZE	= 0x1000

; ----------	SIGNATURES ADDRESS SPACE	------------------------
;   SIGNATURES
.equ	ADDR_SIGNATURES_START		= 0x0000
.equ	ADDR_SIGNATURES_END		= 0x0002
.equ	ADDR_SIGNATURES_SIZE		= 0x0003

; ----------	FUSES ADDRESS SPACE		------------------------
;   FUSES
.equ	ADDR_FUSES_START		= 0x0000
.equ	ADDR_FUSES_END			= 0x0001
.equ	ADDR_FUSES_SIZE			= 0x0002

; ----------	LOCKBITS ADDRESS SPACE		------------------------
;   LOCKBITS
.equ	ADDR_LOCKBITS_START		= 0x0000
.equ	ADDR_LOCKBITS_END		= 0x0000
.equ	ADDR_LOCKBITS_SIZE		= 0x0001

; ----------	DATA ADDRESS SPACE		------------------------
;   REGISTERS
.equ	ADDR_REGISTERS_START		= 0x0000
.equ	ADDR_REGISTERS_END		= 0x001F
.equ	ADDR_REGISTERS_SIZE		= 0x0020
;   MAPPED_IO
.equ	ADDR_MAPPED_IO_START		= 0x0020
.equ	ADDR_MAPPED_IO_END		= 0x00FF
.equ	ADDR_MAPPED_IO_SIZE		= 0x00E0
;   IRAM
.equ	ADDR_IRAM_START			= 0x0100
.equ	ADDR_IRAM_END			= 0x08FF
.equ	ADDR_IRAM_SIZE			= 0x0800

; ----------	EEPROM ADDRESS SPACE		------------------------
;   EEPROM
.equ	ADDR_EEPROM_START		= 0x0000
.equ	ADDR_EEPROM_END			= 0x01FF
.equ	ADDR_EEPROM_SIZE		= 0x0200




; **********************************************************************
; ***************	FUSES REGISTERS		************************
; **********************************************************************
;
.equ	HIGH		= 0x01
.equ	LOW		= 0x00


; ====	FUSE MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register HIGH bits		------------------------
.equ	OCDEN		= 1		; 0x02 - On-Chip Debug Enabled
.equ	JTAGEN		= 0		; 0x01 - JTAG Interface Enabled

; ----------	Register LOW bits		------------------------
.equ	WDTON		= 7		; 0x80 - Watchdog timer always on
.equ	EESAVE		= 6		; 0x40 - Preserve EEPROM through the Chip Erase cycle
.equ	BOOTSZ_MASK	= 0x30		;      - Select boot size (2 bits)
.equ	BOOTSZ0		= 4		;          BOOTSZ BIT0 position
.equ	BOOTRST		= 3		; 0x08 - Boot Reset vector Enabled
.equ	SUT_CKSEL_MASK	= 0x07		;      - Clock Selection (3 bits)
.equ	SUT_CKSEL0	= 0		;          SUT_CKSEL BIT0 position
; ::::  BOOTSZ	:::: bitfield values
;			0x30		; Boot Flash size=256 words Boot address=$4F00
;			0x20		; Boot Flash size=512 words Boot address=$4E00
;			0x10		; Boot Flash size=1024 words Boot address=$4C00
;			0x00		; Boot Flash size=2048 words Boot address=$4800
; ::::  SUT_CKSEL	:::: bitfield values
;			0x00		; Start-up time: 14 CK + 0 ms
;			0x02		; Start-up time: 14 CK + 3.9 ms
;			0x04		; Start-up time: 14 CK + 62.5 ms
;			0x01		; Start-up time: 14 CK + 0 ms
;			0x03		; Start-up time: 14 CK + 3.9 ms
;			0x05		; Start-up time: 14 CK + 62.5 ms




; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


