sterentev/atdf-device-asm-include/inc/ATmega406.inc
; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	BPPLR		= 0xF8		; [MEMORY MAPPED] Battery Protection Parameter Lock Register
.equ	BPCR		= 0xF7		; [MEMORY MAPPED] Battery Protection Control Register
.equ	CBPTR		= 0xF6		; [MEMORY MAPPED] Current Battery Protection Timing Register
.equ	BPOCD		= 0xF5		; [MEMORY MAPPED] Battery Protection OverCurrent Detection Level Register
.equ	BPSCD		= 0xF4		; [MEMORY MAPPED] Battery Protection Short-Circuit Detection Level Register
.equ	BPDUV		= 0xF3		; [MEMORY MAPPED] Battery Protection Deep Under Voltage Register
.equ	BPIR		= 0xF2		; [MEMORY MAPPED] Battery Protection Interrupt Register
.equ	CBCR		= 0xF1		; [MEMORY MAPPED] Cell Balancing Control Register
.equ	FCSR		= 0xF0		; [MEMORY MAPPED] 
.equ	CADIC		= 0xE8		; [MEMORY MAPPED] CC-ADC Instantaneous Current
.equ	CADRDC		= 0xE7		; [MEMORY MAPPED] CC-ADC Regular Discharge Current
.equ	CADRCC		= 0xE6		; [MEMORY MAPPED] CC-ADC Regular Charge Current
.equ	CADCSRB		= 0xE5		; [MEMORY MAPPED] CC-ADC Control and Status Register B
.equ	CADCSRA		= 0xE4		; [MEMORY MAPPED] CC-ADC Control and Status Register A
.equ	CADAC3		= 0xE3		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC2		= 0xE2		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC1		= 0xE1		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC0		= 0xE0		; [MEMORY MAPPED] ADC Accumulate Current
.equ	BGCRR		= 0xD1		; [MEMORY MAPPED] Bandgap Calibration of Resistor Ladder
.equ	BGCCR		= 0xD0		; [MEMORY MAPPED] Bandgap Calibration Register
.equ	CCSR		= 0xC0		; [MEMORY MAPPED] Clock Control and Status Register
.equ	TWBCSR		= 0xBE		; [MEMORY MAPPED] TWI Bus Control and Status Register
.equ	TWAMR		= 0xBD		; [MEMORY MAPPED] TWI (Slave) Address Mask Register
.equ	TWCR		= 0xBC		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0xBB		; [MEMORY MAPPED] TWI Data register
.equ	TWAR		= 0xBA		; [MEMORY MAPPED] TWI (Slave) Address register
.equ	TWSR		= 0xB9		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0xB8		; [MEMORY MAPPED] TWI Bit Rate register
.equ	OCR1AH		= 0x89		; [MEMORY MAPPED] Output Compare Register 1A High byte
.equ	OCR1AL		= 0x88		; [MEMORY MAPPED] Output Compare Register 1A Low byte
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer Counter 1  Bytes
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register
.equ	VADMUX		= 0x7C		; [MEMORY MAPPED] The VADC multiplexer Selection Register
.equ	VADCSR		= 0x7A		; [MEMORY MAPPED] The VADC Control and Status register
.equ	VADC		= 0x78		; [MEMORY MAPPED] VADC Data Register  Bytes
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Enable Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Enable Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	FOSCCAL		= 0x66		; [MEMORY MAPPED] Fast Oscillator Calibration Value
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register 0
.equ	WUTCSR		= 0x62		; [MEMORY MAPPED] Wake-up Timer Control Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x28		; Output compare Register B
.equ	OCR0A		= 0x27		; Output compare Register A
.equ	TCNT0		= 0x26		; Timer Counter 0
.equ	TCCR0B		= 0x25		; Timer/Counter0 Control Register
.equ	TCCR0A		= 0x24		; Timer/Counter0 Control Register
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Address Register  Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter Interrupt Flag register
.equ	PORTD		= 0x0B		; Data Register, Port D
.equ	DDRD		= 0x0A		; Data Direction Register, Port D
.equ	PIND		= 0x09		; Input Pins, Port D
.equ	PORTC		= 0x08		; Port C Data Register
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register VADMUX bits		------------------------
.equ	VADMUX_MASK	= 0x0F		;      - Analog Channel and Gain Selection Bits (4 bits)
.equ	VADMUX0		= 0		;          VADMUX BIT0 position

