sterentev/atdf-device-asm-include/inc/ATmega406.inc
; ----------	Register VADCSR bits		------------------------
.equ	VADEN		= 3		; 0x08 - VADC Enable
.equ	VADSC		= 2		; 0x04 - VADC Satrt Conversion
.equ	VADCCIF		= 1		; 0x02 - VADC Conversion Complete Interrupt Flag
.equ	VADCCIE		= 0		; 0x01 - VADC Conversion Complete Interrupt Enable



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt Sense Control 3 Bits (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control 2 Bits (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control 1 Bits (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control 0 Bits (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x40		; Any Logical Change of INTX
;			0x80		; Falling Edge of INTX
;			0xC0		; Rising Edge of INTX
; ::::  ISC2	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x10		; Any Logical Change of INTX
;			0x20		; Falling Edge of INTX
;			0x30		; Rising Edge of INTX
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change of INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change of INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0x0F		;      - External Interrupt Request 1 Enable (4 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0x0F		;      - External Interrupt Flags (4 bits)
.equ	INTF0		= 0		;          INTF BIT0 position

; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x03		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x03		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR1B bits		------------------------
.equ	CTC1		= 3		; 0x08 - Clear Timer/Counter on Compare Match
.equ	CS1_MASK	= 0x07		;      - Clock Select1 bits (3 bits)
.equ	CS10		= 0		;          CS1 BIT0 position
; ::::  CS1	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/32
;			0x04		; Running, CLK/64
;			0x05		; Running, CLK/128
;			0x06		; Running, CLK/256
;			0x07		; Running, CLK/1024

; ----------	Register TIMSK1 bits		------------------------
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare Flag A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset



; ====	WAKEUP_TIMER MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register WUTCSR bits		------------------------
.equ	WUTIF		= 7		; 0x80 - Wake-up Timer Interrupt Flag
.equ	WUTIE		= 6		; 0x40 - Wake-up Timer Interrupt Enable
.equ	WUTCF		= 5		; 0x20 - Wake-up timer Calibration Flag
.equ	WUTR		= 4		; 0x10 - Wake-up Timer Reset
.equ	WUTE		= 3		; 0x08 - Wake-up Timer Enable
.equ	WUTP_MASK	= 0x07		;      - Wake-up Timer Prescaler Bits (3 bits)
.equ	WUTP0		= 0		;          WUTP BIT0 position
; ::::  WUTP	:::: bitfield values
;			0x00		; 4K(Slow RC) / 1K (32kHz)
;			0x01		; 8K(Slow RC) / 2K (32kHz)
;			0x02		; 16K(Slow RC) / 4K (32kHz)
;			0x03		; 32K(Slow RC) / 8K (32kHz)
;			0x04		; 64K(Slow RC) / 16K (32kHz)
;			0x05		; 128K(Slow RC) / 32K (32kHz)
;			0x06		; 256K(Slow RC) / 64K (32kHz)
;			0x07		; 512K(Slow RC) / 128K (32kHz)



; ====	BATTERY_PROTECTION MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register BPPLR bits		------------------------
.equ	BPPLE		= 1		; 0x02 - Battery Protection Parameter Lock Enable
.equ	BPPL		= 0		; 0x01 - Battery Protection Parameter Lock

; ----------	Register BPCR bits		------------------------
.equ	DUVD		= 3		; 0x08 - 
.equ	SCD		= 2		; 0x04 - 
.equ	DCD		= 1		; 0x02 - 
.equ	CCD		= 0		; 0x01 - 

; ----------	Register CBPTR bits		------------------------
.equ	SCPT_MASK	= 0xF0		;      -  (4 bits)
.equ	SCPT0		= 4		;          SCPT BIT0 position
.equ	OCPT_MASK	= 0x0F		;      -  (4 bits)
.equ	OCPT0		= 0		;          OCPT BIT0 position
; ::::  SCPT	:::: bitfield values
;			0x00		; 61 us
;			0x10		; 122 us
;			0x20		; 183 us
;			0x30		; 244 us
;			0x40		; 305 us
;			0x50		; 366 us
;			0x60		; 427 us
;			0x70		; 488 us
;			0x80		; 610 us
;			0x90		; 732 us
;			0xA0		; 854 us
;			0xB0		; 976 us
;			0xC0		; 1098 us
;			0xD0		; 1220 us
;			0xE0		; 1342 us
;			0xF0		; 1464 us
; ::::  OCPT	:::: bitfield values
;			0x00		; 1 ms
;			0x01		; 2 ms
;			0x02		; 4 ms
;			0x03		; 6 ms
;			0x04		; 8 ms
;			0x05		; 10 ms
;			0x06		; 12 ms
;			0x07		; 14 ms
;			0x08		; 16 ms
;			0x09		; 18 ms
;			0x0A		; 20 ms
;			0x0B		; 22 ms
;			0x0C		; 24 ms
;			0x0D		; 26 ms
;			0x0E		; 28 ms
;			0x0F		; 30 ms

; ----------	Register BPOCD bits		------------------------
.equ	DCDL_MASK	= 0xF0		;      -  (4 bits)
.equ	DCDL0		= 4		;          DCDL BIT0 position
.equ	CCDL_MASK	= 0x0F		;      -  (4 bits)
.equ	CCDL0		= 0		;          CCDL BIT0 position
; ::::  DCDL	:::: bitfield values
;			0x00		; 0.050V
;			0x10		; 0.055V
;			0x20		; 0.060V
;			0x30		; 0.065V
;			0x40		; 0.070V
;			0x50		; 0.080V
;			0x60		; 0.090V
;			0x70		; 0.100V
;			0x80		; 0.110V
;			0x90		; 0.120V
;			0xA0		; 0.130V
;			0xB0		; 0.140V
;			0xC0		; 0.160V
;			0xD0		; 0.180V
;			0xE0		; 0.200V
;			0xF0		; 0.220V
; ::::  CCDL	:::: bitfield values
;			0x00		; 0.050V
;			0x01		; 0.055V
;			0x02		; 0.060V
;			0x03		; 0.065V
;			0x04		; 0.070V
;			0x05		; 0.080V
;			0x06		; 0.090V
;			0x07		; 0.100V
;			0x08		; 0.110V
;			0x09		; 0.120V
;			0x0A		; 0.130V
;			0x0B		; 0.140V
;			0x0C		; 0.160V
;			0x0D		; 0.180V
;			0x0E		; 0.200V
;			0x0F		; 0.220V

; ----------	Register BPSCD bits		------------------------
.equ	SCDL_MASK	= 0x0F		;      -  (4 bits)
.equ	SCDL0		= 0		;          SCDL BIT0 position
; ::::  SCDL	:::: bitfield values
;			0x00		; 0.100V
;			0x01		; 0.110V
;			0x02		; 0.120V
;			0x03		; 0.130V
;			0x04		; 0.140V
;			0x05		; 0.160V
;			0x06		; 0.180V
;			0x07		; 0.200V
;			0x08		; 0.220V
;			0x09		; 0.240V
;			0x0A		; 0.260V
;			0x0B		; 0.280V
;			0x0C		; 0.320V
;			0x0D		; 0.360V
;			0x0E		; 0.400V
;			0x0F		; 0.440V

