sterentev/atdf-device-asm-include/inc/ATmega406.inc
; ----------	Register BPDUV bits		------------------------
.equ	DUVT_MASK	= 0x30		;      -  (2 bits)
.equ	DUVT0		= 4		;          DUVT BIT0 position
.equ	DUDL_MASK	= 0x0F		;      -  (4 bits)
.equ	DUDL0		= 0		;          DUDL BIT0 position
; ::::  DUVT	:::: bitfield values
;			0x00		; 750ms
;			0x10		; 1000ms
;			0x20		; 1250ms
;			0x30		; 1500ms
; ::::  DUDL	:::: bitfield values
;			0x00		; 4.71V
;			0x01		; 5.03V
;			0x02		; 5.34V
;			0x03		; 5.66V
;			0x04		; 5.97V
;			0x05		; 6.29V
;			0x06		; 6.60V
;			0x07		; 6.91V
;			0x08		; 7.23V
;			0x09		; 7.54V
;			0x0A		; 7.86V
;			0x0B		; 8.17V
;			0x0C		; 8.49V
;			0x0D		; 8.80V
;			0x0E		; 9.11V
;			0x0F		; 9.43V

; ----------	Register BPIR bits		------------------------
.equ	DUVIF		= 7		; 0x80 - Deep Under-voltage Early Warning Interrupt Flag
.equ	COCIF		= 6		; 0x40 - Charge Over-current Protection Activated Interrupt Flag
.equ	DOCIF		= 5		; 0x20 - 
.equ	SCIF		= 4		; 0x10 - 
.equ	DUVIE		= 3		; 0x08 - Deep Under-voltage Early Warning Interrupt Enable
.equ	COCIE		= 2		; 0x04 - 
.equ	DOCIE		= 1		; 0x02 - 
.equ	SCIE		= 0		; 0x01 - 



; ====	FET MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register FCSR bits		------------------------
.equ	PWMOC		= 5		; 0x20 - Pulse Width Modulation of OC output
.equ	PWMOPC		= 4		; 0x10 - Pulse Width Modulation Modulation of OPC output
.equ	CPS		= 3		; 0x08 - Current Protection Status
.equ	DFE		= 2		; 0x04 - Discharge FET Enable
.equ	CFE		= 1		; 0x02 - Charge FET Enable
.equ	PFD		= 0		; 0x01 - Precharge FET disable



; ====	COULOMB_COUNTER MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register CADCSRA bits		------------------------
.equ	CADEN		= 7		; 0x80 - When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled.
.equ	CADUB		= 5		; 0x20 - CC_ADC Update Busy
.equ	CADAS_MASK	= 0x18		;      - CC_ADC Accumulate Current Select Bits (2 bits)
.equ	CADAS0		= 3		;          CADAS BIT0 position
.equ	CADSI_MASK	= 0x06		;      - The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. (2 bits)
.equ	CADSI0		= 1		;          CADSI BIT0 position
.equ	CADSE		= 0		; 0x01 - When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode.
; ::::  CADAS	:::: bitfield values
;			0x00		; 125ms
;			0x08		; 250ms
;			0x10		; 500ms
;			0x18		; 1000ms
; ::::  CADSI	:::: bitfield values
;			0x00		; 125ms
;			0x02		; 250ms
;			0x04		; 500ms
;			0x06		; 1000ms

; ----------	Register CADCSRB bits		------------------------
.equ	CADACIE		= 6		; 0x40 - 
.equ	CADRCIE		= 5		; 0x20 - Regular Current Interrupt Enable
.equ	CADICIE		= 4		; 0x10 - CAD Instantaneous Current Interrupt Enable
.equ	CADACIF		= 2		; 0x04 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADRCIF		= 1		; 0x02 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADICIF		= 0		; 0x01 - CC-ADC Instantaneous Current Interrupt Flag



; ====	CELL_BALANCING MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register CBCR bits		------------------------
.equ	CBE_MASK	= 0x0F		;      - Cell Balancing Enables (4 bits)
.equ	CBE0		= 0		;          CBE BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Disable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BODRF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Power Off
;			0x0A		; Reserved
;			0x0C		; Reserved
;			0x0E		; Reserved

; ----------	Register CCSR bits		------------------------
.equ	XOE		= 1		; 0x02 - 32 kHz Crystal Oscillator Enable
.equ	ACS		= 0		; 0x01 - Asynchronous Clock Select

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI		= 3		; 0x08 - Power Reduction TWI
.equ	PRTIM1		= 2		; 0x04 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 1		; 0x02 - Power Reduction Timer/Counter0
.equ	PRVADC		= 0		; 0x01 - Power Reduction V-ADC



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Force Output Compare (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      -  (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Clock Select0 bits (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare
.equ	FOC0B		= 6		; 0x40 - Waveform Generation Mode
.equ	WGM02		= 3		; 0x08 - 
.equ	CS0_MASK	= 0x07		;      - Clock Select0 bits (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register OCR0A bits		------------------------
.equ	OCR0A_MASK	= 0xFF		;      -  (8 bits)
.equ	OCR0A0		= 0		;          OCR0A BIT0 position

; ----------	Register OCR0B bits		------------------------
.equ	OCR0B_MASK	= 0xFF		;      -  (8 bits)
.equ	OCR0B0		= 0		;          OCR0B BIT0 position

; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Output Compare Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Output Compare Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Output Compare Flag
.equ	OCF0A		= 1		; 0x02 - Output Compare Flag
.equ	TOV0		= 0		; 0x01 - Overflow Flag



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWBCSR bits		------------------------
.equ	TWBCIF		= 7		; 0x80 - TWI Bus Connect/Disconnect Interrupt Flag
.equ	TWBCIE		= 6		; 0x40 - TWI Bus Connect/Disconnect Interrupt Enable
.equ	TWBDT_MASK	= 0x06		;      - TWI Bus Disconnect Time-out Period (2 bits)
.equ	TWBDT0		= 1		;          TWBDT BIT0 position
.equ	TWBCIP		= 0		; 0x01 - TWI Bus Connect/Disconnect Interrupt Polarity
; ::::  TWBDT	:::: bitfield values
;			0x00		; 250ms
;			0x02		; 500ms
;			0x04		; 1000ms
;			0x06		; 2000ms

