sterentev/atdf-device-asm-include/inc/ATmega406.inc
; ----------	Register TWAMR bits		------------------------
.equ	TWAM_MASK	= 0xFE		;      -  (7 bits)
.equ	TWAM0		= 1		;          TWAM BIT0 position

; ----------	Register TWCR bits		------------------------
.equ	TWINT		= 7		; 0x80 - TWI Interrupt Flag
.equ	TWEA		= 6		; 0x40 - TWI Enable Acknowledge Bit
.equ	TWSTA		= 5		; 0x20 - TWI Start Condition Bit
.equ	TWSTO		= 4		; 0x10 - TWI Stop Condition Bit
.equ	TWWC		= 3		; 0x08 - TWI Write Collision Flag
.equ	TWEN		= 2		; 0x04 - TWI Enable Bit
.equ	TWIE		= 0		; 0x01 - TWI Interrupt Enable

; ----------	Register TWSR bits		------------------------
.equ	TWS_MASK	= 0xF8		;      - TWI Status (5 bits)
.equ	TWS0		= 3		;          TWS BIT0 position
.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler (2 bits)
.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWAR bits		------------------------
.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address register Bits (7 bits)
.equ	TWA0		= 1		;          TWA BIT0 position
.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	BANDGAP MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register BGCCR bits		------------------------
.equ	BGD		= 7		; 0x80 - Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled.
.equ	BGCC_MASK	= 0x3F		;      - BG Calibration of PTAT Current Bits (6 bits)
.equ	BGCC0		= 0		;          BGCC BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode Bits (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Programming Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Programming Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only




; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 23
.equ	INT_VECTORS_SIZE	= 0x2E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	BPINT		; Battery Protection Interrupt
;	2	INT0		; External Interrupt Request 0
;	3	INT1		; External Interrupt Request 1
;	4	INT2		; External Interrupt Request 2
;	5	INT3		; External Interrupt Request 3
;	6	PCINT0		; Pin Change Interrupt 0
;	7	PCINT1		; Pin Change Interrupt 1
;	8	WDT		; Watchdog Timeout Interrupt
;	9	WAKE_UP		; Wakeup timer overflow
;	10	TIM1_COMP	; Timer/Counter 1 Compare Match
;	11	TIM1_OVF	; Timer/Counter 1 Overflow
;	12	TIM0_COMPA	; Timer/Counter0 Compare A Match
;	13	TIM0_COMPB	; Timer/Counter0 Compare B Match
;	14	TIM0_OVF	; Timer/Counter0 Overflow
;	15	TWI_BUS_CD	; Two-Wire Bus Connect/Disconnect
;	16	TWI		; Two-Wire Serial Interface
;	17	VADC		; Voltage ADC Conversion Complete
;	18	CCADC_CONV	; Coulomb Counter ADC Conversion Complete
;	19	CCADC_REG_CUR	; Coloumb Counter ADC Regular Current
;	20	CCADC_ACC	; Coloumb Counter ADC Accumulator
;	21	EE_READY	; EEPROM Ready
;	22	SPM_READY	; Store Program Memory Ready



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmega406.inc"
;#	
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<OCDEN) \
;#				  & ~(1 <<JTAGEN)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	BOOTSZ		= 0x10	; Boot Flash size=1024 words Boot address=$4C00
;#	.set	SUT_CKSEL	= 0x05	; Start-up time: 14 CK + 62.5 ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		reti			; BPINT		 - Battery Protection Interrupt
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt 0
;#		reti			; PCINT1	 - Pin Change Interrupt 1
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		reti			; WAKE_UP	 - Wakeup timer overflow
;#		reti			; TIM1_COMP	 - Timer/Counter 1 Compare Match
;#		reti			; TIM1_OVF	 - Timer/Counter 1 Overflow
;#		reti			; TIM0_COMPA	 - Timer/Counter0 Compare A Match
;#		reti			; TIM0_COMPB	 - Timer/Counter0 Compare B Match
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; TWI_BUS_CD	 - Two-Wire Bus Connect/Disconnect
;#		reti			; TWI		 - Two-Wire Serial Interface
;#		reti			; VADC		 - Voltage ADC Conversion Complete
;#		reti			; CCADC_CONV	 - Coulomb Counter ADC Conversion Complete
;#		reti			; CCADC_REG_CUR	 - Coloumb Counter ADC Regular Current
;#		reti			; CCADC_ACC	 - Coloumb Counter ADC Accumulator
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; SPM_READY	 - Store Program Memory Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA406_INC_ */

; ************************ END OF FILE *********************************

